## Plan output

```
module.vpc.module.vpc.data.aws_partition.current[0]: Reading...
module.application.module.worker.data.aws_partition.current: Reading...
module.application.module.service.module.alb["this"].data.aws_partition.current: Reading...
module.logging.data.aws_lambda_functions.all: Reading...
module.application.module.secrets.data.aws_caller_identity.identity: Reading...
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.application.data.aws_partition.current: Reading...
module.vpc.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.application.module.worker.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.service.module.alb["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.application.data.aws_caller_identity.identity: Reading...
module.application.module.service.module.ecr["this"].data.aws_caller_identity.current: Reading...
module.application.module.dashboard.data.aws_caller_identity.identity: Reading...
module.application.module.worker.data.aws_caller_identity.identity: Reading...
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=891377151751]
module.application.module.secrets.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.application.module.database.data.aws_partition.current: Reading...
module.application.module.database.data.aws_partition.current: Read complete after 0s [id=aws]
module.logging.module.s3.data.aws_partition.current: Reading...
module.logging.module.s3.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.data.aws_lambda_functions.all: Reading...
module.application.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.application.module.service.module.ecr["this"].data.aws_caller_identity.current: Read complete after 0s [id=891377151751]
module.application.module.service.data.aws_partition.current: Reading...
module.application.module.service.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.worker.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.application.module.dashboard.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.application.module.dashboard.data.aws_partition.current: Reading...
module.logging.module.s3.data.aws_region.current: Reading...
module.application.module.dashboard.data.aws_partition.current: Read complete after 0s [id=aws]
module.logging.module.s3.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.application.module.dashboard.data.aws_route53_zone.domain["this"]: Reading...
module.application.module.dashboard.module.alb["this"].data.aws_partition.current: Reading...
module.application.module.dashboard.module.alb["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.service.data.aws_route53_zone.domain["this"]: Reading...
module.logging.data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.logging.module.s3.data.aws_caller_identity.current: Reading...
module.application.data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.logging.module.s3.data.aws_caller_identity.current: Read complete after 0s [id=891377151751]
module.logging.data.aws_caller_identity.identity: Reading...
module.logging.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.bastion.data.aws_ami.bastion: Reading...
module.bastion.data.aws_caller_identity.identity: Reading...
module.application.module.service.data.aws_region.current: Reading...
module.application.module.service.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.bastion.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.vpc.module.vpc.data.aws_region.current[0]: Reading...
module.vpc.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.application.module.dashboard.data.aws_route53_zone.domain["this"]: Read complete after 0s [id=Z056235726NAHLFZ5UGDD]
module.application.module.secrets.data.aws_partition.current: Reading...
module.application.module.secrets.data.aws_partition.current: Read complete after 0s [id=aws]
module.backend.data.aws_partition.current: Reading...
module.backend.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.database.module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Reading...
module.application.module.database.module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Read complete after 0s [id=76086537]
module.application.module.secrets.data.aws_region.current: Reading...
module.application.module.secrets.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.application.module.service.data.aws_route53_zone.domain["this"]: Read complete after 0s [id=Z056235726NAHLFZ5UGDD]
module.logging.data.aws_elb_service_account.current: Reading...
module.logging.data.aws_elb_service_account.current: Read complete after 0s [id=127311923021]
module.application.module.database.data.aws_region.current: Reading...
module.application.module.database.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.application.module.database.data.aws_caller_identity.identity: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Reading...
module.application.module.database.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Read complete after 1s [id=2644592029]
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Read complete after 1s [id=1315226949]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Read complete after 0s [id=874300523]
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Read complete after 0s [id=1808222790]
module.logging.data.aws_region.current: Reading...
module.logging.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.logging.data.aws_partition.current: Reading...
module.logging.data.aws_partition.current: Read complete after 0s [id=aws]
module.bastion.data.aws_partition.current: Reading...
module.bastion.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.service.module.ecr["this"].data.aws_partition.current: Reading...
module.application.module.service.module.ecr["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.worker.data.aws_region.current: Reading...
module.application.module.worker.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.bastion.data.aws_region.current: Reading...
module.bastion.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_availability_zones.available: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Read complete after 0s [id=1314884315]
module.logging.module.s3.data.aws_organizations_organization.current: Reading...
module.bastion.data.aws_ami.bastion: Read complete after 1s [id=ami-0150ccaf51ab55a51]
module.application.module.dashboard.data.aws_region.current: Reading...
module.application.module.dashboard.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.application.module.database.data.aws_rds_engine_version.this: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.application.module.database.module.database.data.aws_partition.current: Reading...
module.application.module.database.module.database.data.aws_partition.current: Read complete after 0s [id=aws]
module.backend.data.aws_caller_identity.identity: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.application.module.service.data.aws_caller_identity.identity: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Read complete after 0s [id=3795168285]
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Read complete after 0s [id=2187510914]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.backend.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.application.module.service.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.application.module.service.module.ecr["this"].data.aws_iam_policy_document.repository[0]: Reading...
module.application.module.service.module.ecr["this"].data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=475677258]
module.logging.module.s3.data.aws_organizations_organization.current: Read complete after 0s [id=o-f5mr0gq6lc]
module.logging.data.aws_lambda_function.datadog["this"]: Reading...
module.application.data.aws_lambda_function.datadog["this"]: Reading...
module.logging.module.s3.data.aws_iam_policy_document.default: Reading...
module.logging.module.s3.data.aws_iam_policy_document.default: Read complete after 0s [id=705826187]
module.application.module.database.data.aws_rds_engine_version.this: Read complete after 0s [id=17.5]
module.logging.data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-57H7JP-Forwarder-WUhPlW2NzMXr]
module.application.data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-57H7JP-Forwarder-WUhPlW2NzMXr]
module.application.module.service.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Reading...
module.application.module.worker.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Reading...
module.application.module.dashboard.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Reading...
module.application.module.service.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Read complete after 0s [id=/illinois-getchildcare/qa/version]
module.application.module.worker.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Read complete after 0s [id=/illinois-getchildcare/qa/version]
module.application.module.dashboard.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Read complete after 0s [id=/illinois-getchildcare/qa/version]
module.logging.module.s3.data.aws_iam_policy_document.combined: Reading...
module.logging.module.s3.data.aws_iam_policy_document.combined: Read complete after 0s [id=2124188810]
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Reading...
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ec2"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm"]: Read complete after 1s [id=us-east-1]
module.application.module.dashboard.data.aws_vpc.current: Reading...
module.application.module.worker.data.aws_vpc.current: Reading...
module.application.module.service.data.aws_vpc.current: Reading...
module.application.module.dashboard.data.aws_vpc.current: Read complete after 0s [id=vpc-0d4fbd78717d772f7]
module.application.module.worker.data.aws_vpc.current: Read complete after 0s [id=vpc-0d4fbd78717d772f7]
module.application.module.service.data.aws_vpc.current: Read complete after 0s [id=vpc-0d4fbd78717d772f7]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Read complete after 0s [id=1314884315]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Read complete after 0s [id=1315226949]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Read complete after 0s [id=2644592029]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Read complete after 0s [id=3795168285]
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=90403638]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Read complete after 0s [id=195798706]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Read complete after 0s [id=2187510914]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Read complete after 1s [id=1808222790]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Read complete after 1s [id=874300523]
module.application.module.dashboard.data.aws_secretsmanager_secret_version.oidc["this"]: Reading...
module.application.module.dashboard.data.aws_secretsmanager_secret_version.oidc["this"]: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/oidc-20250717174559817700000001-U8tPQA|AWSCURRENT]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.application.aws_s3_bucket.get_child_care_illinois will be created
  + resource "aws_s3_bucket" "get_child_care_illinois" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "get-child-care-illinois-qa"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "environment" = "qa"
          + "project"     = "illinois-getchildcare"
          + "tofu"        = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.application.aws_s3_bucket_lifecycle_configuration.get_child_care_illinois will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "get_child_care_illinois" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "state"
          + status = "Enabled"

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }

          + filter {
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 90
            }
        }
    }

  # module.application.aws_s3_bucket_logging.get_child_care_illinois will be created
  + resource "aws_s3_bucket_logging" "get_child_care_illinois" {
      + bucket        = (known after apply)
      + id            = (known after apply)
      + target_bucket = "illinois-getchildcare-qa-logs"
      + target_prefix = "s3-bucket-access-logs/get-child-care-illinois-qa/"
    }

  # module.application.aws_s3_bucket_policy.get_child_care_illinois will be created
  + resource "aws_s3_bucket_policy" "get_child_care_illinois" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:*",
                        ]
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = false
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = [
                          + "arn:aws:s3:::get-child-care-illinois-qa",
                          + "arn:aws:s3:::get-child-care-illinois-qa/*",
                        ]
                      + Sid       = "AllowSSLRequestsOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.application.aws_s3_bucket_public_access_block.get_child_care_illinois will be created
  + resource "aws_s3_bucket_public_access_block" "get_child_care_illinois" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "get-child-care-illinois-qa"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.application.aws_s3_bucket_server_side_encryption_configuration.get_child_care_illinois will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "get_child_care_illinois" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.application.aws_s3_bucket_versioning.get_child_care_illinois will be created
  + resource "aws_s3_bucket_versioning" "get_child_care_illinois" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```